Sammlung Inhalte/Tests_BA/cmrq010_3connections_siege_terminal.txt
** SIEGE 4.1.7
** Preparing 3 concurrent users for battle.
The server is now under siege...
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.26 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.15 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.25 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     2.23 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.26 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.26 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.26 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.30 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.25 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.25 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.21 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.26 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.26 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.30 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.25 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.25 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.21 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.26 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.26 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.30 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.25 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.25 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.21 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.26 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.26 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.30 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.25 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.25 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.21 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.30 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.25 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.25 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.21 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.26 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.26 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.30 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.25 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.25 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.21 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.26 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.26 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.30 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.25 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.25 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.21 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.26 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.26 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.30 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.25 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.25 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.21 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.26 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.26 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.30 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.25 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.25 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.21 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.30 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.25 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.25 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.21 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.26 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.26 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.30 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.25 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.25 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.21 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.26 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.26 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.30 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.25 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.25 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.21 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.26 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.26 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.30 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.25 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.25 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.21 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.30 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.25 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.25 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.21 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.26 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.26 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.30 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.25 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.25 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.21 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.26 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.26 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.30 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.25 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.25 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.21 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.26 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.26 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.30 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.25 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.25 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.21 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  
Lifting the server siege...
Transactions:		      332    hits
Availability:		      100.00 %
Elapsed time:		       60.31 secs
Data transferred:	        0.02 MB
Response time:		      538.92 ms
Transaction rate:	        5.50 trans/sec
Throughput:		        0.00 MB/sec
Concurrency:		        2.97
Successful transactions:      332
Failed transactions:	        0
Longest transaction:	     2230.00 ms
Shortest transaction:	      180.00 ms
 
LOG FILE: cmrq010_3connections_siege.log
You can disable this log file notification by editing
/home/ifm/.siege/siege.conf and changing 'show-logfile' to false.
/deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.30 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.25 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.25 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.21 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.26 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.26 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.30 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.25 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.25 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.21 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.18 secs:      49 bytes ==> GET  /deviceinfo/getdata